In [49]:
import sqlite3

# Kết nối đến SQLite database
conn = sqlite3.connect("school.db")
cursor = conn.cursor()

# Tạo bảng course
cursor.execute("""
CREATE TABLE IF NOT EXISTS course (
    id INTEGER PRIMARY KEY,
    course_name TEXT
)
""")

# Tạo bảng student
cursor.execute("""
CREATE TABLE IF NOT EXISTS student (
    student_id INTEGER PRIMARY KEY,
    name TEXT,
    class TEXT,
    course_id INTEGER NULL,
    score REAL
)
""")

# Chèn dữ liệu vào bảng course
course_data = [
    (12, "Giai tich"),
    (34, "Thong ke"),
    (26, "Tin hoc")]
# Xóa dữ liệu cũ
cursor.execute("DELETE FROM course")

cursor.executemany("INSERT INTO course VALUES (?, ?)", course_data)

# Chèn dữ liệu vào bảng student
student_data = [
    (1, "Nguyen Minh Hoang", "May Tinh", 12, 6.7),
    (2, "Tran Thi Lan", "Kinh Te", 34, 9.2),
    (3, "Pham Van Nam", "Toan Tin", None, 7.9),  # Giá trị trống
    (4, "Le Thanh Huyen", "Toan Tin", 20, 7.2),
    (5, "Vu Quoc Anh", "May Tinh", 24, 8.0),
    (6, "Dang Thuy Linh", "May Tinh", 24, 5.5),
    (7, "Bui Tien Dung", "Kinh Te", 34, 9.2),
    (8, "Ho Ngoc Mai", "Toan Tin", 20, 8.8),
    (9, "Duong Huu Phuc", "Kinh Te", None, 7.2),  # Giá trị trống
    (10, "Cao Thi Hanh", "May Tinh", None, 7.0)]   # Giá trị trống
cursor.execute("DELETE FROM student")
cursor.executemany("INSERT INTO student VALUES (?, ?, ?, ?, ?)", student_data)

# Lưu thay đổi và đóng kết nối
conn.commit()
conn.close()

print("Đã tạo bảng và chèn dữ liệu thành công!!")

Đã tạo bảng và chèn dữ liệu thành công!!

# Câu 1:

In [50]:
# Thực hiện tích Descartes
conn = sqlite3.connect("school.db")
cursor = conn.cursor()
cursor.execute("SELECT * FROM student CROSS JOIN course")
result = cursor.fetchall()
# In kết quả
print("Kết nối 2 bảng bằng tích Descartes thành công!")
for row in result:
    print(row)

Kết nối 2 bảng bằng tích Descartes thành công!
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich')
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 26, 'Tin hoc')
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 34, 'Thong ke')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 12, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 26, 'Tin hoc')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 12, 'Giai tich')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 26, 'Tin hoc')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 34, 'Thong ke')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 12, 'Giai tich')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 26, 'Tin hoc')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 34, 'Thong ke')
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 12, 'Giai tich')
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 26, 'Tin hoc')
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 34, 'Thong ke')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 12, 'Giai tich')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 26, 'Tin hoc')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 34, 'Thong ke')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 12, 'Giai tich')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 26, 'Tin hoc')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 12, 'Giai tich')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 26, 'Tin hoc')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 34, 'Thong ke')
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 12, 'Giai tich')
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 26, 'Tin hoc')
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 34, 'Thong ke')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 12, 'Giai tich')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 26, 'Tin hoc')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 34, 'Thong ke')

In [51]:
# Thực hiện INNER JOIN
cursor.execute("""
    SELECT student.student_id, student.name, student.class, course.course_name, student.score
    FROM student
    INNER JOIN course ON student.course_id = course.id;
""")
result = cursor.fetchall()
# In kết quả
print("Kết nối 2 bảng bằng INNER JOIN thành công!")
for row in result:
    print(row)

Kết nối 2 bảng bằng INNER JOIN thành công!
(1, 'Nguyen Minh Hoang', 'May Tinh', 'Giai tich', 6.7)
(2, 'Tran Thi Lan', 'Kinh Te', 'Thong ke', 9.2)
(7, 'Bui Tien Dung', 'Kinh Te', 'Thong ke', 9.2)

In [52]:
# Thực hiện LEFT JOIN
cursor.execute("""
    SELECT student.*, course.course_name
    FROM student
    LEFT JOIN course ON student.course_id = course.id
""")
result = cursor.fetchall()
print("Kết nối 2 bảng bằng LEFT JOIN thành công!")
for row in result:
    print(row)

Kết nối 2 bảng bằng LEFT JOIN thành công!
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Thong ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, None)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, None)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Thong ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None)
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, None)
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, None)

In [53]:
# Thực hiện RIGHT JOIN
cursor.execute("""
    SELECT course.*, student.name, student.class, student.score
    FROM course
    LEFT JOIN student ON student.course_id = course.id
""")
result = cursor.fetchall()
print("Kết nối 2 bảng bằng RIGHT JOIN thành công!")
for row in result:
    print(row)

Kết nối 2 bảng bằng RIGHT JOIN thành công!
(12, 'Giai tich', 'Nguyen Minh Hoang', 'May Tinh', 6.7)
(26, 'Tin hoc', None, None, None)
(34, 'Thong ke', 'Bui Tien Dung', 'Kinh Te', 9.2)
(34, 'Thong ke', 'Tran Thi Lan', 'Kinh Te', 9.2)

In [54]:
# Thực hiện FULL OUTER JOIN
cursor.execute("""
    SELECT student.*, course.course_name
    FROM student
    LEFT JOIN course ON student.course_id = course.id
    UNION
    SELECT student.*, course.course_name
    FROM course
    LEFT JOIN student ON student.course_id = course.id;
""")
result = cursor.fetchall()
print("Kết nối 2 bảng bằng FULL OUTER JOIN thành công!")
for row in result:
    print(row)

Kết nối 2 bảng bằng FULL OUTER JOIN thành công!
(None, None, None, None, None, 'Tin hoc')
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Thong ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, None)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, None)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Thong ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None)
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, None)
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, None)

# Câu 2:

In [55]:
# Cập nhật course_id bị thiếu
cursor.execute("""
    UPDATE student
    SET course_id = (SELECT id FROM course ORDER BY RANDOM() LIMIT 1)
    WHERE course_id IS NULL;
""")

# Xóa các bản ghi có course_id không hợp lệ
cursor.execute("""
    DELETE FROM student
    WHERE course_id NOT IN (SELECT id FROM course);
""")
conn.commit()

print("Cập nhật và dọn dẹp dữ liệu thành công!")

Cập nhật và dọn dẹp dữ liệu thành công!

In [56]:
# tổng số sinh viên, điểm trung bình của từng lớp
cursor.execute("""
    SELECT class, COUNT(*) AS total_student, AVG(score) AS avg_score
    FROM student
    GROUP BY class;
""")
result = cursor.fetchall()
for row in result:
    print(f"Lớp: {row[0]}, Tổng số sinh viên: {row[1]}, Điểm trung bình: {row[2]:.2f}")

Lớp: Kinh Te, Tổng số sinh viên: 3, Điểm trung bình: 8.53
Lớp: May Tinh, Tổng số sinh viên: 2, Điểm trung bình: 6.85
Lớp: Toan Tin, Tổng số sinh viên: 1, Điểm trung bình: 7.90

In [57]:
# Tổng số sinh viên, điểm trung bình của từng môn học
# Tổng số sinh viên
cursor.execute("SELECT COUNT(*) FROM student")
total_student = cursor.fetchone()[0]
# Điểm trung bình của từng môn học
cursor.execute("""
    SELECT course.course_name, AVG(student.score) AS average_score
    FROM student
    JOIN course ON student.course_id = course.id
    GROUP BY course.course_name
""")
average_scores = cursor.fetchall()
# In kết quả
print(f"Tổng số sinh viên: {total_student}")
print("\nĐiểm trung bình của từng môn học:")
for course, avg_score in average_scores:
    print(f"{course}: {avg_score:.2f}")

Tổng số sinh viên: 6

Điểm trung bình của từng môn học:
Giai tich: 7.20
Thong ke: 9.20

In [58]:
# Phân loại thi đua theo số điểm của từng môn học
cursor.execute("""
    SELECT course.course_name, 
           AVG(student.score) AS average_score,
           CASE 
               WHEN AVG(student.score) >= 9.0 THEN 'Xuất sắc'
               WHEN AVG(student.score) BETWEEN 6.0 AND 8.9 THEN 'Tốt'
               WHEN AVG(student.score) < 6.0 THEN 'Kém'
           END AS classification
    FROM student
    JOIN course ON student.course_id = course.id
    GROUP BY course.course_name
""")
results = cursor.fetchall()
print("Phân loại kết quả thi:")
for course, avg_score, classification in results:
    print(f"{course}: {avg_score:.2f} - {classification}")

Phân loại kết quả thi:
Giai tich: 7.20 - Tốt
Thong ke: 9.20 - Xuất sắc

# Câu 3

In [61]:
# Xếp hạng theo điểm số
cursor.execute("""
    SELECT student_id, name, score, 
           RANK() OVER (ORDER BY score DESC) AS rank
    FROM student;
""")
print("Xếp hạng theo điểm số:")
print(cursor.fetchall())

# Xếp hạng theo lớp học
cursor.execute("""
    SELECT student_id, name, class, score, 
           RANK() OVER (PARTITION BY class ORDER BY score DESC) AS rank
    FROM student;
""")
print("\nXếp hạng theo lớp học:")
print(cursor.fetchall())

# Xếp hạng theo mã môn học
cursor.execute("""
    SELECT student_id, name, course_id, score, 
           RANK() OVER (PARTITION BY course_id ORDER BY score DESC) AS rank
    FROM student;
""")
print("\nXếp hạng theo môn học:")
print(cursor.fetchall())

Xếp hạng theo điểm số:
[(2, 'Tran Thi Lan', 9.2, 1), (7, 'Bui Tien Dung', 9.2, 1), (3, 'Pham Van Nam', 7.9, 3), (9, 'Duong Huu Phuc', 7.2, 4), (10, 'Cao Thi Hanh', 7.0, 5), (1, 'Nguyen Minh Hoang', 6.7, 6)]

Xếp hạng theo lớp học:
[(2, 'Tran Thi Lan', 'Kinh Te', 9.2, 1), (7, 'Bui Tien Dung', 'Kinh Te', 9.2, 1), (9, 'Duong Huu Phuc', 'Kinh Te', 7.2, 3), (10, 'Cao Thi Hanh', 'May Tinh', 7.0, 1), (1, 'Nguyen Minh Hoang', 'May Tinh', 6.7, 2), (3, 'Pham Van Nam', 'Toan Tin', 7.9, 1)]

Xếp hạng theo môn học:
[(3, 'Pham Van Nam', 12, 7.9, 1), (9, 'Duong Huu Phuc', 12, 7.2, 2), (10, 'Cao Thi Hanh', 12, 7.0, 3), (1, 'Nguyen Minh Hoang', 12, 6.7, 4), (2, 'Tran Thi Lan', 34, 9.2, 1), (7, 'Bui Tien Dung', 34, 9.2, 1)]

In [67]:
# Top 3 sinh viên cao nhất & thấp nhất theo điểm số cá nhân
query = """
WITH top_students AS (
    SELECT student_id, name, score
    FROM student
    ORDER BY score DESC
    LIMIT 3
),
bottom_students AS (
    SELECT student_id, name, score
    FROM student
    ORDER BY score ASC
    LIMIT 3
)
SELECT * FROM top_students
UNION ALL
SELECT * FROM bottom_students
ORDER BY score DESC;
"""
cursor.execute(query)
results = cursor.fetchall()
print("Top 3 sinh viên cao nhất & thấp nhất:")
for row in results:
    print(row)

Top 3 sinh viên cao nhất & thấp nhất:
(2, 'Tran Thi Lan', 9.2)
(7, 'Bui Tien Dung', 9.2)
(3, 'Pham Van Nam', 7.9)
(9, 'Duong Huu Phuc', 7.2)
(10, 'Cao Thi Hanh', 7.0)
(1, 'Nguyen Minh Hoang', 6.7)

In [68]:
# Top 3 sinh viên cao nhất và thấp nhất theo từng lớp học
query = """
WITH RankedStudents AS (
    SELECT 
        student_id, 
        name, 
        class, 
        score,
        RANK() OVER (PARTITION BY class ORDER BY score DESC) AS high_rank,
        RANK() OVER (PARTITION BY class ORDER BY score ASC) AS low_rank
    FROM student
)
SELECT student_id, name, class, score, 'Top 3 Cao Nhất' AS ranking_type
FROM RankedStudents
WHERE high_rank <= 3
UNION ALL
SELECT student_id, name, class, score, 'Top 3 Thấp Nhất' AS ranking_type
FROM RankedStudents
WHERE low_rank <= 3
ORDER BY class, ranking_type, score DESC;
"""
cursor.execute(query)
results = cursor.fetchall()
print("Top 3 sinh viên cao nhất và thấp nhất theo từng lớp:")
for row in results:
    print(row)

Top 3 sinh viên cao nhất và thấp nhất theo từng lớp:
(2, 'Tran Thi Lan', 'Kinh Te', 9.2, 'Top 3 Cao Nhất')
(7, 'Bui Tien Dung', 'Kinh Te', 9.2, 'Top 3 Cao Nhất')
(9, 'Duong Huu Phuc', 'Kinh Te', 7.2, 'Top 3 Cao Nhất')
(2, 'Tran Thi Lan', 'Kinh Te', 9.2, 'Top 3 Thấp Nhất')
(7, 'Bui Tien Dung', 'Kinh Te', 9.2, 'Top 3 Thấp Nhất')
(9, 'Duong Huu Phuc', 'Kinh Te', 7.2, 'Top 3 Thấp Nhất')
(10, 'Cao Thi Hanh', 'May Tinh', 7.0, 'Top 3 Cao Nhất')
(1, 'Nguyen Minh Hoang', 'May Tinh', 6.7, 'Top 3 Cao Nhất')
(10, 'Cao Thi Hanh', 'May Tinh', 7.0, 'Top 3 Thấp Nhất')
(1, 'Nguyen Minh Hoang', 'May Tinh', 6.7, 'Top 3 Thấp Nhất')
(3, 'Pham Van Nam', 'Toan Tin', 7.9, 'Top 3 Cao Nhất')
(3, 'Pham Van Nam', 'Toan Tin', 7.9, 'Top 3 Thấp Nhất')

In [71]:
# Top 3 sinh viên cao nhất và thấp nhất theo từng môn học
query = """
WITH RankedStudents AS (
    SELECT 
        student_id, 
        name, 
        course_id, 
        score, 
        RANK() OVER (PARTITION BY course_id ORDER BY score DESC) AS high_rank,
        RANK() OVER (PARTITION BY course_id ORDER BY score ASC) AS low_rank
    FROM student
)
SELECT student_id, name, course_id, score, 'Top 3 cao nhất' AS rank_type
FROM RankedStudents
WHERE high_rank <= 3

UNION ALL

SELECT student_id, name, course_id, score, 'Top 3 thấp nhất' AS rank_type
FROM RankedStudents
WHERE low_rank <= 3

ORDER BY course_id, rank_type DESC, score DESC;
"""
cursor.execute(query)
results = cursor.fetchall()

print("Top 3 sinh viên cao nhất và thấp nhất theo từng môn học:")
for row in results:
    print(row)

Top 3 sinh viên cao nhất và thấp nhất theo từng môn học:
(9, 'Duong Huu Phuc', 12, 7.2, 'Top 3 thấp nhất')
(10, 'Cao Thi Hanh', 12, 7.0, 'Top 3 thấp nhất')
(1, 'Nguyen Minh Hoang', 12, 6.7, 'Top 3 thấp nhất')
(3, 'Pham Van Nam', 12, 7.9, 'Top 3 cao nhất')
(9, 'Duong Huu Phuc', 12, 7.2, 'Top 3 cao nhất')
(10, 'Cao Thi Hanh', 12, 7.0, 'Top 3 cao nhất')
(2, 'Tran Thi Lan', 34, 9.2, 'Top 3 thấp nhất')
(7, 'Bui Tien Dung', 34, 9.2, 'Top 3 thấp nhất')
(2, 'Tran Thi Lan', 34, 9.2, 'Top 3 cao nhất')
(7, 'Bui Tien Dung', 34, 9.2, 'Top 3 cao nhất')

# Câu 4:

In [ ]:
# Thêm cột graduation_date nếu chưa có
cursor.execute("ALTER TABLE student ADD COLUMN graduation_date DATETIME")

In [79]:

# Cập nhật graduation_date dựa vào thứ hạng theo điểm số
query = """
WITH RankedStudents AS (
    SELECT 
        student_id, 
        score,
        RANK() OVER (ORDER BY score DESC) AS rank
    FROM student
)
UPDATE student
SET graduation_date = DATE('now', '+' || (
    SELECT rank FROM RankedStudents WHERE student.student_id = RankedStudents.student_id
) || ' days')
"""
cursor.execute(query)
conn.commit()
# Kiểm tra kết quả
cursor.execute("SELECT student_id, name, score, graduation_date FROM student")
results = cursor.fetchall()

print("Danh sách sinh viên sau khi cập nhật ngày tốt nghiệp:")
for row in results:
    print(row)

Danh sách sinh viên sau khi cập nhật ngày tốt nghiệp:
(1, 'Nguyen Minh Hoang', 6.7, '2025-03-17')
(2, 'Tran Thi Lan', 9.2, '2025-03-12')
(3, 'Pham Van Nam', 7.9, '2025-03-14')
(7, 'Bui Tien Dung', 9.2, '2025-03-12')
(9, 'Duong Huu Phuc', 7.2, '2025-03-15')
(10, 'Cao Thi Hanh', 7.0, '2025-03-16')